// Next.js API route support: https://nextjs.org/docs/api-routes/introduction

export default (req, res) => {
  res.status(200).json({
    card: {
      title: "2021年东方明珠广播电视塔（看上海·超值票）成人票",
      price: 199,
      marketPrice: 199,
      sale: 23676,
      img: "./img/card.webp",
      info: ["随买随用", "官方", "有条件退", "快速入园", "入园保障"],
      star: 3.9,
      comment: 1295,
    },

    notice: [
      {
        title: "费用包含",
        list: [
          `1）259米透明悬空廊；
          2）263米主观光层；
          3）“梦·上海” 多媒体投影秀；
          4）上海城市历史发展陈列馆；
          5）塔身灯光秀（19:30、20:30、21:30）；
          6）《聚·上海》多媒体穹顶投影秀（19:00、20:00）；
          7）O-Friends乐园`
        ]
      },
      {
        title: "预定说明",
        list: [
          `购买时间:可随时购买使用`
        ]
      },
      {
        title: "使用说明",
        list: [
          `使用方法：无需换票，持 「商家券码」 直接入园`,
          `入园时间：08:00-20:30`,
          `入园地址：东方明珠4.2米入口处`
        ]
      },
      {
        title: "退改说明",
        list: [
          `使用日期截止后364天23:59前未消费可申请退款，退款不收手续费。过期未消费系统自动发起退款申请。
          一笔订单多张票不支持部分退款。下单后不支持改期`
        ]
      },
      {
        title: "其他说明",
        list: [
          `1）263米主观光层-举目浦江两岸，深度了解上海的沧海巨变和丰厚的文化底蕴
          2）259米全透明悬空观光廊-空中漫步，全球唯一的360度全透明玻璃观光廊
          3） “梦·上海” 多媒体投影秀。
            梦·上海：东方明珠塔倾力原创设计，特别打造的《梦•上海》——“老上海的时光回响”多媒体投影首秀摩登上演。位于上海城市历史发展陈列馆内，以数字多媒体艺术演绎手法，将老上海最具代表性的人、情、物，融汇到梦境般的画面中，结合富有沉浸感的视觉和听觉体验，在上海咖啡馆各个建筑折面上精彩呈现。
          4）COCA-MINIPARK-网红拍照点？可口可乐复古藏品？光影互动装置？就在全新升级的MINIPARK6）上海城市历史发展陈列馆-展现700年前至今上海城市历史的变迁`
        ]
      },
    ],

    location: {
      name: "东方明珠广播电视塔",
      distance: "25km",
      address: "浦东新区浦东世纪大道1号（近二号线陆家嘴站）",
      supplier: "上海东方明珠广播电视塔有限公司",
      time: "09:30-20:30"
    },

    comment: {
      num: 1296,
      list: [
        {
          name: "用户1",
          img: "/img/user.png",
          star: 5,
          time: "2021-05-15",
          content: ` `
        },
        {
          name: "用户2",
          img: "/img/user.png",
          star: 4,
          time: "2021-05-15",
          content: `还可以哦，不过赶上的日期不好，人超级多。好像是95吧，里面的VR过山车不推荐，我掐表计时，只有55秒，70大洋，关键是5g画面不那么真实。267米的透明长廊还是值得推荐的。总体来讲，值得一玩，时间选择要慎重。`
        },
        {
          name: "用户3",
          img: "/img/user.png",
          star: 4,
          time: "2021-05-15",
          content: ` `
        },
      ]
    },
  })
}
